//Даны шесть различных натуральных чисел. Определить максимальное из них (использовать функцию нахождения максимума из двух).
#include <iostream>
#include <math.h>
#include <algorithm>

using namespace std;

void task14()
{
	int a = { 1 };
	int b = { 2 };
	int c = { 3 };
	int d = { 4 };
	int e = { 5 };
	int f = { 6 };
	int max = { 0 };



	cout << max;
}